import struct

acc1 = [4428,
47489,
20506,
49402,
20506,
16634,
418,
47823,
50926,
49406,
50926,
16638,
17126,
14739,
52301,
49396,
52301,
16628]

acc2 = [6706,
15018,
56988,
49415,
56988,
16647,
35498,
47370,
21846,
49413,
21846,
16645,
40436,
47652,
31813,
49405,
31813,
16637]

def acc_decode(f, s):
    b_fs = struct.pack('>HH', s, f)
    res = struct.unpack('>f', b_fs)
    return res[0]

for i in range(len(acc1)): # [0,1] (Вибростойкость по оси X), [6,7] (Вибростойкость по оси Y), [12,13] (Вибростойкость по оси Z)
    if i not in [1, 7, 13]:
        continue
    res = acc_decode(acc1[i-1], acc1[i])
    print(f"{i}: {res}")